In [1]:
import pandas as pd

In [2]:
obj=pd.Series([4,7,-5,3])

In [3]:
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])
print(obj2)

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2.dtype

dtype('int64')

In [8]:
s=pd.Series([9904312,3448737,2890451,2466052],index=['서울','부산','인천','대구'])
print(s)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [9]:
s.name="인구"
s.index.name="도시"

In [10]:
print(s)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [11]:
s/1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [12]:
s[0]

9904312

In [13]:
s[1]

3448737

In [14]:
s["서울"]  #s[0]

9904312

In [15]:
s[[0,2]]

도시
서울    9904312
인천    2890451
Name: 인구, dtype: int64

In [16]:
s>=2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [17]:
s[s>=2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [18]:
s[(s>2500000) &(s<5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [19]:
s[1:3]  # 1부터 3이전의 인덱스까지

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [20]:
s["서울":"인천"]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [21]:
data={'서울':3000, '부산':2000,'인천':1000,'대전':1500}
s2=pd.Series(data)
s2

서울    3000
부산    2000
인천    1000
대전    1500
dtype: int64

In [22]:
s-s2

대구          NaN
대전          NaN
부산    3446737.0
서울    9901312.0
인천    2889451.0
dtype: float64

In [23]:
ds=s-s2
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [24]:
ds[ds.notnull()]

부산    3446737.0
서울    9901312.0
인천    2889451.0
dtype: float64

In [25]:
rs=(s-s2)/s2*100
rs[rs.notnull()]

부산    172336.850000
서울    330043.733333
인천    288945.100000
dtype: float64

In [26]:
rs

대구              NaN
대전              NaN
부산    172336.850000
서울    330043.733333
인천    288945.100000
dtype: float64

In [27]:
rs['부산']=1.6
rs['대구']=1.41
del rs['서울']

In [28]:
rs

대구         1.41
대전          NaN
부산         1.60
인천    288945.10
dtype: float64

In [29]:
rs[rs.notnull()]

대구         1.41
부산         1.60
인천    288945.10
dtype: float64

In [30]:
data={"2015":[9904312,3448734,2890451,2466052],"2010":[9631482,3393191,2632035,2431774]}

In [31]:
data

{'2015': [9904312, 3448734, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774]}

In [32]:
df=pd.DataFrame(data)

In [33]:
df

      2015     2010
0  9904312  9631482
1  3448734  3393191
2  2890451  2632035
3  2466052  2431774

In [34]:
df.index=["서울","부산","인천","대구"]

In [35]:
df

       2015     2010
서울  9904312  9631482
부산  3448734  3393191
인천  2890451  2632035
대구  2466052  2431774

In [36]:
df=pd.DataFrame(data, index=["서울","부산","인천","대구"])

In [37]:
df

       2015     2010
서울  9904312  9631482
부산  3448734  3393191
인천  2890451  2632035
대구  2466052  2431774

In [42]:
ind=["2015","2010"]
col=["서울","부산","대구","인천"]
data=[[9904312,3448734,2890451,2466052],[9631482,3393191,2632035,2431774]]

In [43]:
df=pd.DataFrame(data, index=ind, columns=col)

In [44]:
df

           서울       부산       대구       인천
2015  9904312  3448734  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [45]:
df.values

array([[9904312, 3448734, 2890451, 2466052],
       [9631482, 3393191, 2632035, 2431774]], dtype=int64)

In [46]:
df.index

Index(['2015', '2010'], dtype='object')

In [47]:
df.columns

Index(['서울', '부산', '대구', '인천'], dtype='object')

In [48]:
df["서울"]

2015    9904312
2010    9631482
Name: 서울, dtype: int64

In [51]:
df2=df.T

In [52]:
df2

       2015     2010
서울  9904312  9631482
부산  3448734  3393191
대구  2890451  2632035
인천  2466052  2431774

In [53]:
df2['2015']

서울    9904312
부산    3448734
대구    2890451
인천    2466052
Name: 2015, dtype: int64

In [55]:
df2[['2015']]

       2015
서울  9904312
부산  3448734
대구  2890451
인천  2466052

In [56]:
df2[['2015','2010']]

       2015     2010
서울  9904312  9631482
부산  3448734  3393191
대구  2890451  2632035
인천  2466052  2431774

In [57]:
df2["2005"]=[10000,20000,30000,40000]

In [58]:
df2

       2015     2010   2005
서울  9904312  9631482  10000
부산  3448734  3393191  20000
대구  2890451  2632035  30000
인천  2466052  2431774  40000

In [59]:
df2[0:1]

       2015     2010   2005
서울  9904312  9631482  10000

In [61]:
df2['서울':'대구']

       2015     2010   2005
서울  9904312  9631482  10000
부산  3448734  3393191  20000
대구  2890451  2632035  30000

In [63]:
df2['2015'].count()

4

In [64]:
import numpy as np

In [66]:
df2['2015']['부산']=np.nan

In [67]:
df2

         2015     2010   2005
서울  9904312.0  9631482  10000
부산        NaN  3393191  20000
대구  2890451.0  2632035  30000
인천  2466052.0  2431774  40000

In [69]:
df2.loc['서울']

2015    9904312.0
2010    9631482.0
2005      10000.0
Name: 서울, dtype: float64

In [71]:
df2.iloc[3]

2015    2466052.0
2010    2431774.0
2005      40000.0
Name: 인천, dtype: float64

In [72]:
df2['2010']>=2500000

서울     True
부산     True
대구     True
인천    False
Name: 2010, dtype: bool

In [75]:
pop=pd.read_csv("population_number.csv",encoding="euc-kr",index_col="도시")

In [76]:
pop

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [77]:
pop.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [78]:
pop['2015'].value_counts()

2466052    1
2890451    1
3448737    1
9904312    1
Name: 2015, dtype: int64

In [80]:
pop['2010'].sort_values(ascending=False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [83]:
score=pd.read_csv("score.csv",encoding="euc-kr",index_col="과목")

In [84]:
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [85]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [86]:
score.sum().sort_values()

4반    243
1반    271
3반    295
2반    388
dtype: int64

In [87]:
score["합계"]=score.sum(axis=1)

In [88]:
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163